app/Http/Controllers/CartController.php

    public function index()
    {
        $session = FacadesSession::getId();
        $cart = Cart::with('product')->get();
---
select * from `carts`
select * from `products` where `products`.`id` in (1, 2)