app/Http/Controllers/DashboardController.php

select * from `categories` where `categories`.`id` = '1' order by `category` asc limit 1
---
    public function show($id)
    {
        $category = Category::with('product')->findOrFail($id);