app/Http/Controllers/DashboardController.php

    public function index()
    {
        $category = Cache::remember('category', now()->minute(10), function () {
            return Category::all();
        });
        $product = Cache::remember('product', now()->minutes(10), function () {
            return Product::take(4)->get();
        });
        $user = Cache::remember('user', now()->minutes(10), function () {
            return User::get();
        });
        $session = Cache::remember('session', now()->minutes(10), function () {
            return Session::all();
        });
        $color = Cache::remember('color', now()->minutes(10), function () {
            return Color::all();
        });
---
select * from `categories` order by `category` asc
select * from `products` limit 4
select * from `users`
select * from `colors`

    public function show(Request $request, $id)
    {
        if ($request->low) {

            $category = Category::with(['product' => function ($query) {
                $query->orderBy('price', 'asc')->get();
            }], 'subcategory')->findOrFail($id);
---
select * from `products` where `products`.`category_id` in (1)