app/Http/Controllers/OrderController.php

    public function store(StoreOrderRequest $request)
    {

        foreach ($request->cart_id as $key => $value) {
            Order::create([
                'address_id' => $request->address_id,
                'cart_id' => $value,
                'payment_status' => $request->payment_status,
            ]);
---
insert into `orders` (`address_id`, `cart_id`, `payment_status`, `updated_at`, `created_at`) values ('4', '1', '1', '2022-01-26 06:49:15', '2022-01-26 06:49:15')