app/Http/Controllers/ProductDetailController.php

    public function show($id)
    {
        $product = Product::with('image')->findOrFail($id);
---
select * from `images` where `images`.`product_id` in (2)
select * from `products` where `products`.`id` = '2' limit 1